{
  "news": [
    {
      "section": "1",
      "heading": "Locked In",
      "borderColor": "#007bff",
      "images": [
        "https://i.gyazo.com/5673ecc7e6c5d1222e3321ea2ec7c370.png"
      ],
      "text": {
        "p1": "One of the most well known and active communities in SCP:Roleplay, Locked In, is a community known for their collaborative work where individuals are able to share resources including guides to being an ideal faction, and several more.",
        "p2": "A part of Locked In's success is their ability to avoid drama by having a moderation team that is actively moderating the community. A unique way of them preventing this is by isolating the causes of the drama, which has proven to be effective.",
        "p3": "Although there has been a dramatic decrease in the game's member count, Locked In owner states that \"It definitely isn't dead\". Moreover, he concluded that without the presence of custom servers, a significant number of people would not be playing the game.",
        "p4": "Despite the communities' negative history with the SCP:Roleplay Faction Hub, Locked In has earned its recognition by the community. The founder's initial goal: \"to make a name for myself within the community and to help others with my experience\" has been achieved, with Locked In becoming \"a beacon of community engagement.\"",
        "p5": "However, leading such community also comes with challenges. As they do not possess a promotion based system, keeping the community active can be a difficult task. Additionally, leadership also demands neutrality. \"It is also hard being impartial toward decisions, as personal beliefs and biases can cloud judgement.\", he stated.",
        "p6": "Ultimately, Locked In is not trying to become to most popular servers like others, its focus is on equality, fairness, and education instead.",
        "p7": "Written by: Pooh <br>\nInterviewed by: pie <br>\nLocked in Discord: <a href=\"https://discord.gg/aPjkNYxU8W\" target=\"_blank\" rel=\"noopener noreferrer\">Invite Link</a>"
      }
    },
    {
      "section": "2",
      "heading": "ACA-107 Map Revamp Insight",
      "borderColor": "#6828ec",
      "images": [
        "https://i.gyazo.com/ef486ea89ab71e35749a7b35f268f4a3.png"
      ],
      "text": {
        "p1": "In the past month, there has been a sudden shock between individuals in the ACA-107 community. One of their ownership personnel has officially resigned from their position. In addition with this, they have also privatized which included several key documents.",
        "p2": "The team behind ACA-107 has recently announced their ambitious plans to completely revamp the whole system for the server. <br>What first began as an unfortunate drawback has now created the perfect opportunity for a new era of innovations. Rather than simply replacing what was lost, leadership took the opportunity to reevaluate the entire foundation of the site.",
        "p3": "The upcoming revamp will primarily focus on their map. They have revealed that they will be implementing important roleplay areas which has not been used in a large number of sites such as dorms and break rooms. In addition to these, they are also planning to adjust the elevation distribution on their new map by keeping both sector 1 and sector 2 to the same level.",
        "p4": "Beyond SCP:Roleplay, they have taken inspiration from other games as well including ARC-478. The team is introducing a clearance application system which allows players to advance through submitting an application. \"Naturally, since we want to be welcoming to new players, these are really easy and simple to maintain the overall flow of rankings.\", the owner stated.",
        "p5": "As ACA-107 prepares for this monumental update, excitement continues to build within the community. The revamp represents resilience and commitment to improvement.",
        "p6": "Written by: Pooh <br>\nInterviewed by: The Only JJ <br>\nDiscord invite link: <a href=\"https://discord.gg/Bzzwrwbxum\" target=\"_blank\" rel=\"noopener noreferrer\">Discord Invite</a>"
      }
    },
    {
      "section": "3",
      "heading": "Omega-13",
      "borderColor": "#aa0000",
      "images": [
        "https://i.gyazo.com/387e40b4174d76ecf92edd4df1419277.png"
      ],
      "text": {
        "p1": "In a recent interview, cyclonic5, the owner of Omega-13 \"Revenants\", has shared his history and insights behind this wonderful faction.",
        "p2": "After discovering SCP:Roleplay, cyclonic5 has begun playing it for fun. He joined multiple factions which he found engaging, great, and overall a good experience. This has led to him creating the faction we all know today. He stated that the project began \"mainly just out of fun\".",
        "p3": "When it comes to management, he maintains a friendly appearance rather than a strict approach. \" Approaching as a friend can make people more cooperative and mature.” he stated in the interview. This act has not only made faction personnel enjoy the environment, but also keeps them in order.",
        "p4": "Although major new features are not in mind yet, cyclonic5 expresses excitement on the new up-coming high ranking candidates and the faction's growth. Furthermore, Omega-13 aims to revamp their many factors including their divisions, lore, and purpose.",
        "p5": "The Omega-13 \"Revenants\" continues to grow as a welcoming faction for the SCP:Roleplay community.",
        "p6": "Written by: Pooh <br>\nInterviewed by: The Only JJ <br>\nDiscord Invite Link: <a href=\"https://discord.gg/eNvmZuJ28E\" target=\"_blank\" rel=\"noopener noreferrer\">Discord Invite</a>"
      }
    }
  ]
}
