{
  "news": [
    {
      "section": "1",
      "heading": "Facility-03",
      "borderColor": "#007bff",
      "images": [
        "https://i.gyazo.com/9f57cf6b4caa0b02cd30465d9c1852b5.png"
      ],
      "text": {
        "p1": "Facility-03 stands out among SCP: Roleplay servers by focusing on a smaller, close-knit community instead of chasing large numbers. New players are always welcome, but the team values quality interactions over rapid growth. This mindset has helped create a calm, cooperative atmosphere that many other servers struggle to maintain.",
        "p2": "Staff and member activity is handled with understanding. Inactive players are reminded of their positions and can take an official Leave of Absence if needed. Burnout is treated seriously, allowing members to take breaks without losing their roles. This patient and respectful approach helps keep morale high and prevents unnecessary turnover.",
        "p3": "Drama is kept to a minimum through clear rules and level-headed moderation. Discussions are allowed if they remain civil, but arguments are stopped before they escalate. When issues arise between groups, the leadership team focuses on resolving them quickly and diplomatically.",
        "p4": "Facility-03's leadership believes SCP: Roleplay is currently in a period of growth, especially among custom servers. Recent updates have encouraged creativity and given each community its own distinctive identity, attracting more players overall.",
        "p5": "Roleplay quality within Facility-03 is ensured by accessible rules displayed in-game, active moderators, and an engaged ownership team that participates alongside regular players. Veteran members also help new players learn the lore and gameplay flow, fostering an inclusive environment for everyone.",
        "p6": "Two elements truly define Facility-03: its Cold War-era lore and its interactive expeditions. Set in 1982 under NAAD, the North Atlantic Anomalous Defense, the site combines military realism with SCP anomalies in a NATO-versus-USSR setting. Expeditions expand the experience with custom-made missions such as AMO-06, featuring vehicles, unique enemies, and even boss battles.",
        "p7": "Join F-03 Today! https://discord.gg/dhZumjFV6R",
        "p8": "Written by: Hayden (maxielegacy)<br>\nInterviewed by: pi (dynasty5976)"
      }
    },
    {
      "section": "2",
      "heading": "Site-56, leadership and ownership",
      "borderColor": "#eb6514",
      "images": [
        "https://i.gyazo.com/fa89fcdab2266c9dff7a9d1b1a1f6429.png"
      ],
      "text": {
        "p1": "First of all, lets establish what makes Site-56 so different and where they are headed. Site-56 has a huge aim towards learning from everyone's mistakes and learning what exactly caused that to happen. They do this so that they can provide the best long term roleplay experience possible for their members. They achieve this by diving into the suggestions, comments and feedback given by the community so that they can take what is being requested, test it, implement it and see how it works. This strategy allows them to be heavily in tune with what the community wants and what their goal is, a great site. Furthermore, they also collaborate with other high-ranking members from other Factions to allow for them to share ideas on what does and doesn't work, a true representation of the diversity and shared respect within the community.",
        "p2": "However with community, comes drama. Site-56 has had it's fair share of drama, but the drama itself isn't an issue, it is how you handle it, and move on from it. Naturally, we won't go into details, but the biggest thing you can remember is to think very carefully about who you hire, and be very careful with who you trust. Remembering at all times that a staff member is an extension of the owner/administrator of the relevant site, Site-56 advises that simply not causing drama prevents it, a worthy note for all. Hire those who will not give issue, and have processes to deal with those who do. Additionally while handling drama, there must be a full discussion with community and admin alike on what the next few steps are. Transparency will keep you out of drama getting worse, and potentially even boost your reputation as a net effect.",
        "p3": "Finally, for all of you that want to create a Site and build a community, some advice from a seasoned veteran, the Site-56 Administrator. The motivation for creating your Site must be something strong, undying and close to you as a person. In the case of Site-56 this was wanting to create a giant family-like dynamic for the community allowing for the mistakes of the past to pave a path to a better future. <br> <br>\nIn the words of the Site-56 Administrator: \"Do not give up, embrace the fact that a site's success is dictated by your own action\"",
        "p4": "Join Site-56!<br><a href=\"https://discord.gg/Site56\" target=\"_blank\" rel=\"noopener noreferrer\">S56 Discord</a>",
        "p5": "Written by: Whar (whar9244)<br>\nInterviewed by: FreeFormAaron (freeformaaron)"
      }
    },
    {
      "section": "3",
      "heading": "News Team",
      "borderColor": "#acd3ff",
      "images": [],
      "text": {
        "p1": "Hello everyone! <br> Director of the FH News team here, if you have any suggestions, feedback or comments, feel free to ping me in the Faction Hub server or DM me directly on Discord (whar9244). <br> I am really looking for ways to improve the news constantly so that you guys can receive the best source possible. <br> Finally, if you are interested in information about the news team and the joining process, shoot me a DM on Discord and I will try reply within 24 hours. <br> (Yes this includes Sites/Factions looking for publicity by being interviewed by our team)"
      }
    }
  ]
}