{
   "news": [
      {
         "section": "1",
         "heading": "Astra Enterprises",
         "borderColor": "#323b53",
         "images": [
            "https://i.gyazo.com/53ab536e0e0460130df8a3ddfbfde51c.png"
         ],
         "text": {
            "p1": "Astra Enterprises, a verified server within the SCP: Roleplay Factions Hub on Roblox, has released new insight into the vision and direction guiding the community’s development. The project’s creator explained that the inspiration for launching an SCP-focused roleplay server came from years of participating in similar communities and wanting to share that enjoyment through a unique interpretation of the SCP universe.\n<br>\nThe creator notes extensive familiarity with the SCP franchise, developed through years of reading SCP entries, watching related content, and engaging with fan-made games. This long-standing interest has shaped Astra Enterprises’ approach to lore building, world design, and community roleplay standards.",
            "p2": "In discussing the future, leadership aims to expand immersion and depth over the next year. Recent addon features have opened the door for collaboration with scripters, with the goal of creating a more intricate roleplay experience tailored to players seeking detailed and in-depth scenarios. <br>\nAstra Enterprises also maintains a structured yet flexible creative environment. The group operates an official website containing established lore pieces for members to reference. While regulations exist to preserve cohesion, players are encouraged to build their own stories and characters within the framework of existing lore.",
            "p3": "To prevent burnout among staff and members, the group adopts a relaxed quota system. Leadership emphasizes that participation should be voluntary and enjoyable, allowing individuals to engage at a pace that suits them. This approach supports both long-term community members and newcomers who may prefer casual involvement.\n<br>\nThe continued growth of Astra Enterprises highlights a commitment to immersive storytelling, community freedom, and sustainable engagement within the SCP: Roleplay ecosystem.\n<br>\nSo? What are you waiting for, join Astra Enterprises today! <a href=\"https://discord.gg/txhrAtMqX9\" target=\"_blank\" rel=\"noopener noreferrer\">Discord Invite</a>",
            "p4": "Interviewee: sugarkatmeow <br>\nInterviewer: tnb_thanthebeast (The Only JJ) <br>\nWriter: maxielegacy (Hayden) <br>\nDirector: whar9244"
         }
      },
      {
         "section": "2",
         "heading": "Summit PMC",
         "borderColor": "#9b1c17",
         "images": [
            "https://i.gyazo.com/28fdd539086a940d50e8249acc4fe2be.png"
         ],
         "text": {
            "p1": "In the universe of SCP: Roleplay, there are a variety of factions ranging from Mobile Task Forces to Military themed factions. However, one faction stood out to us the most. It was the Summit PMC. Originating from 1997, they represent themselves as a private military corporation which mainly provides security based services.\n<br>\nTheir long term goal was something that the majority of faction could not achieve. It was to make the most disciplined, respected, and immersive mil-sim experience in SCP:Roleplay. Unlike many other factions, they build their operations on real world military structure and tactics, ensuring that every deployment feels realistic and fun.",
            "p2": "Moving on the drama management, one of the biggest issues among the community, Summit PMC has enforced strict regulations to prevent it from happening.\n<br><br>\nThe owner has also revealed that the SCP:RP's Faction Hub has also played a huge role in the faction's success. Around half of their current members came from there, making it one of their biggest recruitment tools.\n\nFurthermore, the original idea of Summit PMC came from another known server called \"Blackwater PMC\". It has inspired Summit PMC in several aspects with the main one being to create a realistic military faction. Although there's inspiration involved, it is not necessarily easy. Recruiting personnel, especially high command for a group with no connections can be surprisingly hard. Beyond recruiting, balancing and keeping members engaged is also required in their growth. As the owner explained, running a faction isn't only about playing the game, it also involves management, development, and sustainability to ensure that the community keeps growing.\n<br> <br>\nThe Summit Group awaits your call, join Summit PMC today through their discord! <a href=\"https://discord.gg/wY9MzQ7rSg\" target=\"_blank\" rel=\"noopener noreferrer\">Discord Invite</a>",
            "p3": "Interviewee: koffline_\nInterviewer: dynasty5976 (pie)\nWriter: pooohtoast (pooh)\nDirector: whar9244"
         }
      },
      {
         "section": "3",
         "heading": "Directors Notes & Applications",
         "borderColor": "#072648",
         "images": [
            "https://i.gyazo.com/52ab2160dd4ad39118bc0c2158db08fe.png"
         ],
         "text": {
            "p1": "Hello everyone! Currently writing is the Factions Hub News Team Director here with a few announcements <br>\nFirst and foremost, my superstar team members have received their roles in the Factions Hub server as the keen-eyed have noticed. They have been given this role as a method for not only us to show the fact that we exist but also a form of recognition of their service and dedication to the Factions Hub. If you see one in the wild, feel free to say hi to them, they can answer news related questions but if you do feel you need to contact me directly I am always fine with being messaged directly.",
            "p2": "Next up on the order is applications. <br>\nI will be running a few polls in the <b>#community-news</b> channel in the Factions Hub discord to see who is interested, who would like to apply, who is unsure and who needs more information before coming to a conclusive decision. We are really looking to grow and we will be doing something special at some point in the near future, a once-only experience for 2 lucky members of our team, but that will be next year. <br>\nFor now what you need to know is that we have 3 teams, an Interview team, a Writing team and a Website team. <br> In short, the interview team goes out and asks Site owners and Faction owners about their group, their visions etc. The writing team writes the articles down and the website team manages the lovely website you're reading this on. <br> <br>\nIn terms of reasons to apply, the greatest one I look for personally is passion, love for the community and involvement/engagement with the FH directly. These people are typically honest and earnest people who will do their best for the team, <i>cough-cough</i> the FH Staff and SCP:RP Staff teams also value such traits <i>cough-cough</i>. <br>\nIf you have any questions regarding news and what I've said here, contact me on discord either via DMs or just ping me.",
            "p3": "Final Notes: <br>\nI am also looking for feedback on the articles to see what the community expects from us. For feedback my DMs are the place the go. <br>\nIf you are a group looking for publicity and are well established, shoot me a message too and I will see what we can do for you, with that said, please do not advertise in my dms... <br> <br>\nAnyways that is all from me, long live FH News! <br>\n- Director whar9244"
         }
      }
   ]
}