{
  "news": [
    {
      "section": "1",
      "heading": "Mobile Task Force Nu-7 \"Hammer Down\"",
      "borderColor": "#007bff",
      "images": [
        "https://i.gyazo.com/92def516370d754b08951b4e071af4fe.png"
      ],
      "text": {
        "p1": "Mobile Task Force Nu-7 \"Hammer Down\" is a large and formidable division in the SCP Foundation universe on Roblox's SCP: Roleplay. Being one of the few factions not disorganized for mass operation, Nu-7 is highly structured and organized for mass operations. The team consists of Special Operations Infantry, armored vehicle companies, tank platoons, helicopter squadrons, CBRN units, combat engineers, and nuclear weapons specialists, supported by a complement of logistics and communications personnel. Based out of Armed Bio-Containment Area-14, their role is to act when Foundation locations go dark, especially in high-risk situations like containment failure, hostile breaches, or other decisive incidents. Always the goal is the same: restore order, maintain containment, and restore operations.\n",
        "p2": "In the roleplay universe, Nu-7 has earned a solid reputation as competent and reliable. While not every member excels at roleplay, collectively, the unit plays professionally and consistently. They regularly patrol sites, defensive actions, and emergency responses during in-game incidents. The presence of having them there sends a message to factions and players alike that the Foundation has an on-hand and dependable unit for any event. It's this symbiotic integration of discipline, coordination, and readiness that Nu-7 carries themselves above other factions within SCP:RP.",
        "p3": "Nu-7's history and growth are also impressive. They're the only SCP:RP faction that ever successfully had a seven-way merge, combining all of the existing Nu-7 factions into one. This served to cause the faction to grow at a rate greater than any other, achieving the first 1,000 members in less than a year, with most other factions taking years to do so. Today, Nu-7 is not only one of the largest factions in the game, but also of the most influential.",
        "p4": "In addition to combat and size, Nu-7 is also renowned for being welcoming to new players. Unlike some factions who keep a strict command of rules or kick members out for not knowing all from the beginning, Nu-7 is all about guidance and learning. Everyone, newbie or oldie, can gain knowledge of the faction, SCP universe, and roleplaying as a whole. This focus on inclusivity has helped develop a cohesive, active, and devoted community.\n",
        "p5": "The other significant divergence is Area-14, Nu-7's headquarters and official location. It's not a base, it's a full lore-accurate facility used for training, operations, and a replication of the faction's history. With strength, unity, inclusivity, and authenticity all in one, MTF Nu-7 \"Hammer Down\" remains a staple of Roblox's SCP: Roleplay community and a replication of what the best faction must be."
      }
    },
    {
      "section": "2",
      "heading": "Site Virtus",
      "borderColor": "#800000",
      "images": [
        "https://i.gyazo.com/cfb9b4f7f93e8aca15b356e216c45e07.png"
      ],
      "text": {
        "p1": "One of the largest servers in SCP:RP, Site Virtus, has recently revealed that they are undergoing a massive revamp, let's dive in!",
        "p2": "Additionally, a promotional video is also hinted to be released for this major revamp. once their map and revamp is completed.<br>\n\nTheir staff team is currently working on hierarchy, moderation & roleplay, map, and many more things for the community to enjoy!<br><br>\n\nWith the continuous hard work of their developers and high authority personnel, Site Virtus has been delivering us amazing quality roleplay and will continue to do so in the future."
      }
    }
  ]
}