{
  "news": [
    {
      "section": "1",
      "heading": "Faction of the Week: The Chaos Insurgency",
      "borderColor": "red",
      "images": "https://gyazo.com/842e304ca20eb1d615bc6162c174282a",
      "text": {
        "p1": "<h2>Introductory</h2>\n\n<b>The Chaos Insurgency</b> (TCI), founded on 24/06/2023 by <ins>Subypro1</ins> and now under <ins>UWUMRMAXB</ins> leadership, is a Faction based on the Group of Interest by the same name, Chaos Insurgency.",
        "p2": "This faction is one of the biggest hostile-based Factions in the Custom Servers community and operates in Site-45, Site-64, and Site-416. These sites are some of the biggest sites out there.",
        "p3": "<h2>Achievements</h2>\n\nThe Chaos Insurgency takes pride in its Scrimmages group, which has remained undefeated since 2024. This is a remarkable achievement that few can claim, and it’s rare to see a faction maintain such dominance for so long.",
        "p4": "Apart from that, The Chaos Insurgency has reached a milestone few have, having 1,500 server members (excluding bots), this was achieved on 22 August of this year. In addition, the Chaos Insurgency currently has around 856 members participating in the faction as Chaos Insurgents.\n",
        "p5": "This is even more impressive when considering that on 22 September 2023, the Chaos Insurgency had only 200 members in its server. This growth demonstrates the faction’s resilience over more than two years and highlights how far it has come.\n",
        "p6": "<h2>Faction of the Month</h2>\nThe Faction Hub Community Team would like to congratulate the Chaos Insurgency for its great success; due to that, it is awarded the title of Faction of the Month. This title was given after careful consideration from our Staff Team and is a mark of recognition. So, why not give the faction a visit ? <a href=\"https://discord.gg/tci\">JOIN TCI </a>",
        "p7": "<br><h5>Join the faction: <a href=\"https://discord.gg/tci\"> discord.gg/tci </a> </h5>"
      }
    },

    {
      "section": "2",
      "heading": "Site of the Week: Site 416",
      "borderColor": "#007bff",
      "images": "https://gyazo.com/319916307acab5466733b9b57315578a",
      "text": {
        "p1": "Open arms to newbies and veterans alike, Site 416 is welcoming everyone. Site 416, one of the oldest groups in SCP: Roleplay has recently been interviewed by our team, so here are the results. One of the biggest findings was that it is extremely friendly towards new players, casual/serious roleplay is their primary reason for an SSU (Server Start up) which alongisde their varying difficulty of learning sub-facions makes for an easy onboarding for anyone of any origin. Their map is currently based off of the official SCP: Roleplay map however they will be changing this soon to their own custom site! Their site itself is moderated by a team which was brought together to deal with the massive influx on new players, doing a great job only being noted for ticket response times, an impressive feat given the huge spike in players, a result of many years of battles, trials and tribulations. Through a long path they have managed to fight back to 8k+ members and a vibrant community of committed users who join to 3+ month long SSU actively. For all you old and gold roleplayer, this site has what you need, many subfactions, long SSUs only challenged by shutdowns causing reSSUs and a whole lot more. Personally, I think all readers should give Site 416 a try if custom sites are in their crosshairs for SCP:RP, and now onto an in depth analysis for the readers who want a longer explanation.",
        "p2": "Site-416, a multi-thousand member group being one of the biggest groups/sites in SCP: Roleplay was recently interviewed by our Staff Team with the three interviewees being two of the Site's Admins, Polaris and Redact, and the Founder, Administrator and community loved Redeye_416.",
        "p3": "Site 416 mainly focuses on roleplay in a style in which everyone can join in on, for the most part their SSUs (Server Start Ups) are hosted with the intention of casual/semi-serious roleplay but include an element of serious roleplay within departments and subfactions should a user feel that they would like to roleplay. They also show intention for expanding roleplay out of basic role tasks for non faction members allowing users and newcomers alike to roleplay in this site, speaking of which one of their primary goals with roleplay, accessible and possible roleplay for everyone who feels like joining Site-416. Additionally they noted that they have a whole team who are trying their best to make this possible! Their dedication for a wide-based user happiness base is very impressive and big props to them for doing this. In terms of current progress, new members can expect easy adaptation to the new environment as it stands and can immediately jump into roleplay and being involved in either casual roleplay or even scheduled serious roleplay. If you are looking for roleplay as a seasoned veteran or even a first-timer Site-416 is definitely a worthy place to check out and invest some time into.",
        "p4": "\nBut for you as the player, simply being told this isn't enough, so a dive into a mental picture of their site and teams would be useful! Their map is a modified variant of the SCP: Roleplay base map aimed to suit their different sub-factions better, make it easy to remember especially for SCP: Roleplay vets. They have their own advanced sub-factions with try-outs and nuances for an extremely in depth roleplay experience. However Site-416's roadmap includes a new and improved map that is detailed, custom and will feel unique and boost the roleplay experience for all users, they also have an increased player cap for bigger roleplays and custom moderation teams!\n",
        "p5": "Although this has been a long time coming, after their 4+ years in as a group starting on May 11th 2021 under the name Task Force 416 with the Site itself launching on November 3rd 2021 until closing down 10 years after their 1 year anniversary reopening on April 2nd 2022 as the Site 416 we all know and love. During this time period they managed to amass a daily of 100+ players sometimes even CCUs reaching 5000+ members at the end of that year! After fighting through long battles with their own staff and SCP: Roleplays staff and even the founder ,Redeye-416, being banned only being unbanned 9 months later. However they immediately bounced back only to be banned again. One final battle later and a really good appeal, they were unbanned yet again on January 21st 2025 only to be thrown into a rocky start but through pure perseverance and love for what they do, they managed to push through to May 16th, the anniversary and update date of SCP: Roleplay which spiked users back into the site leading to their 3+ month long SSU, 8100 amassed users and hundreds of Concurrent Users (CCUs), which is a huge milestone that they should be proud of, although they were underprepared they still managed to cope with it which in my opinion is amazing! Battling through years of trials and tribulations they are in their prime and ready to be the amazing Site they have always been destined to be.",
        "p6": "With all that popularity comes a whole lot of moderation, Redeye's handpicked higher-ups have only impressed time and time again, putting in hours into the server and community however they do acknowledge ticket response times and overall coverage are something they wish to improve on, notably response times. But credit where credit is due, for a team that had to emergency scramble to what became an insanely impressively long SSU, they did pretty well to handle it. All props to them for that. For a sense of scale, they have had an SSU with 240+ players on at once, gained 7000 discord members in the span of 4 and a half month time period, at almost any time you will see they have active members in their server, and no less than 40 at that. They are also to date one of the oldest SCP: Roleplay communities standing 4 years and going strong even long enough to receive custom morph worthy awards for a 2022 Faction Video Contest as a first place prize!",
        "p7": "A final note for the newbies who are hooked: The site has recently been exceptionally welcoming, it is easy to learn, roundabout similar to SCP: Roleplay itself. It is easy to pick it up and quite the fun learning ground for roleplay as a whole, you can learn a lot while here such as dos and don'ts of roleplay. I personally highly recommend that you join their server and give it a try for yourself. The subfactions are truly the place to shine here as well, theres many a subfaction each unique in it's own individual way ranging from Class D gangs to combative teams. Definitely worth a try.",
        "p8": "<br><h5>Join the Site: <a href=\"https://discord.gg/site416\"> discord.gg/site416 </a> </h5>"
      }
    },
    {
      "section": "3",
      "heading": "Site 416: A Personal Memoir",
      "borderColor": "black",
      "images": "https://gyazo.com/6cfece5ea2875e354f65795988f36f50",
      "text": {
        "p1": "Finally a personal note <BR> from the interviewees on what has kept them in the Site 416 community.",
        "p2": "From one of three very experienced Site Administrators, Redact:      \n\"Site-416 is a community which enabled me and provided me the opportunity to work on a larger scale. As a member who had been involved in the administration since 2021, I’ve watched the community grow. As such, I hope to see it improve, and also contribute to this improvement myself\"",
        "p3": "From Polaris, a community staple and a Site Administrator alike: \"Vibes to be honest. I mean, the community itself is kind of the only reason we’d be here, without them there’d be no reason for us to put in the work. I cannot stress how much the new people we’ve brought on board, many of whom who’ve taken up management positions in the site have brought so much to the table that it’s basically a brand new site. I have my own gripes with SCPRP’s community and even our own in Site-416, but rest assured the loyalty of the community is what really keeps this place together. The Site-416 of today is not the same Site-416 as two years ago, or even two months ago, or two weeks, and it will not be the same Site-416 in two weeks, months, or years if we get that far. We owe a lot of that to the community for sticking around for so long, and I am SO excited for them to see what senior staff has been working on behind the scenes, I think it will be lovely and really make a site for everyone.\"",
        "p4": "And finally from Redeye, the spark that lit the fuse to a firework dazzling the custom servers scene forever: \"Having built up the 416 community for over 4 years now, I’ve formed strong relationships with lifelong friends and bonded over memories that I’ll look back on for the rest of my life. Personally, Site-416 acts as a safe place for me to escape the troubles and worries of life while relaxing in a community where I’m surrounded by friends and familiar faces. No matter what struggles or hardships greet us down the road, I’ll always remember that one time in 8th grade when I made a lego roleplay special forces group and called it “Task Force 416” lmao.\""
      }
    }
  ]
}
