{
  "news": [
    {
      "section": "Site-416",
      "heading": "Breaking News!",
      "borderColor": "#000000",
      "images": [],
      "text": {
        "p1": "Site-416 Upper Echelon disappears in almost 4 hours!<br>Redeye, the Founder of Site-416 - Redact, a Community Legend; and Rollers, another legend, all retired within 4 hours of each other, putting the server in partial disarray. SSUs will be paused for a few days while they try to control things. However, this isn't the end for Site-416, and we'd like to congratulate bettieblack for becoming the new Owner of Site-416.<br>"
      }
    },
    {
      "section": "TCI",
      "heading": "The Chaos Insurgency",
      "borderColor": "#910000",
      "images": ["https://i.gyazo.com/a73526e0d0b0f74a7e5018711c825280.png"],
      "text": {
        "p1": "<b>TCI UPLOADING</b><br><b>UPLOAD COMPLETE... RUNNING TCI</b><br><br>Welcome to The Chaos Insurgency. Faction of the week, combat masters, efficient beings and a very huge part of The Engineers plans.<br><br><b><i>LOADING PROPAGANDA</i></b><br><br>The amazing FH News Outreach team interviewed The Chaos Insurgency, specifically Engineer's Assist foosiel, about a few topic, and here are the results for you all.<br><br>The Chaos Insurgency, henceforth the TCI, are full-steam-ahead focusing on reaching 2000 members and becoming the single largest faction in the whole of Roblox, ambitious and yet reasonable. The TCI get involved in SCP:RP naturally and you'd expect a serious almost acting level roleplay but you'd be wrong there, these guys and girls just want to have some fun! Shoot MTF, have fun, shoot MTF again, coffee break and shoot more MTF, those Nu-7 had it coming. Their insane ability to attract members and hold them really brings life to the faction every time they deploy.",
        "p2": "The CISF (Chaos Insurgency Special Forces) are also flourishing like a garden of lead and rifles, being filled to the brim with above-average players, they've dominated in near every scrim they partake in claiming they haven't lost in quite a long time, they must be quite skilled and amazing to pull that off! On the topic of combat, Kev is the person behind all of the CISF activities, spy deployments, scrims, usual CI stuff. But how did they manage 1700 members? Well that is curtsey of foosiel, the recruiter. By letting people in on the fact that TCI has a lovely community filled up with acceptance, love and community spirit. Their members love what they do and make sure their best is always what is shown, even in rough times. TCI also has lovely team building, whether playing random games in VC or playing SCP:RP it is always a good time over at The Chaos Insurgency!",
        "p3": "Now as for growth and expansion: TCI has big plans to expand. Their main joining methods consist of tryouts, drafts due to previous experience, more specifically members with basic military knowledge for forms and ranks, they don't mind too much if you struggle to kill someone with a mag, they'll train you up and make you a machine, the best of the best at kidnapping SCP-999.<br><br>Huge thanks to foosiel and The Chaos Insurgency for letting us in and allowing us this time to get some of their knowledge! Congrats on Faction of the week guys, well deserved.",
        "p4": "NOW JOIN THE CHAOS INSURGENCY <a href=\"https://discord.gg/tci\">The Chaos Insurgency</a><br><br>Thanks to Selgupro and AeroFlare for interviewing",
        "p5": "<b><i>END PROPAGANDA, EXIT CODE: TCI</i></b>"
      }
    },
    {
      "section": "GOC",
      "heading": "The Global Occult Coalition",
      "borderColor": "#206694",
      "images": ["https://i.gyazo.com/6e913346ba7f7cd3ccace9b04f735128.png"],
      "text": {
        "p1": "We sent AeroFlare right into the Global Occult Coalition territory to give them a nice interview, and here are the results:<br><br>Inside of the SCP:RP community, not only do The Chaos Insurgency love fun, the Global Occult Coalition (GOC henceforth) want some fun too. Their primary mission is providing a fun, authentic GOC experience to all of their many members, all of which want a taste and potentially more of what it's like to be on this side of the coin. Containing and terminating anomalies, raiding sites, engaging in meaningful dispute and shaping roleplay in unique ways so people can truly feel a part of something different!",
        "p2": "In the wise words of uuutherr, the GOC Acting Director, \"Throughout my time I've seen that people often have this bastardized perspective on Groups of Interest factions, due to how the sites focus all of their aspects on Foundation and keep other important parts misrepresented. Leading a GOC as big as mine helps to fight this conception and show players how we can rival Foundation, if not surpass them.\\\"<br>A truly important note because it is true, the GOC is actively fighting social misconceptions and issues within the SCP community. Isn't that beautiful? True modern heroes.",
        "p3": "Now let us dive into the meat of the coconut, operations. To keep the realism alive, the GOC leader and commanders always ask, \"What would the GOC realistically do?\\\". Ensuring they keep realism high and immersion at an all-time high! They operate under treaties, pacts and contracts that enable their GOC responsibilities of protecting human lives, concealing knowledge of the abnormal and eliminating threats to mankind. They do this in junction with sites quite often but they are uniquely different from Site Personnel. You send E-11, well they send armored suits and mages to deal with it. You ignore a group of interest, but these guys, they jump right into action confronting them head on. When people evacuate and leave the weak to die, the GOC puts their lives on the line to save every single person. What a beautiful mentality, none lesser no more. They push for peace quite a lot ensuring their operatives are seen as UNGOC personnel who are partners of the Foundation, but never their employees.",
        "p4": "But why are they different from other groups?<br>They offer a non-hostile experience where players can cooperate with others while maintaining independence, they can influence actual site lore through just their presence as the GOC have their own unique methods, they can help other Groups Of Interest by allowing them into their Council 108 network for inclusion and representation. The GOC is at the forefront of developing community for GOC style groups by making their presence known and making big changes in the SCPRP world, this group is heavily important to community growth and deserves much attention.<br><br>Give the GOC a try:<a href=\"https://discord.gg/6qGtmJRrEZ\">The Global Occult Coalition</a>"
      }
    },
    {
      "section": "Josh",
      "heading": "Josh Promotion ",
      "borderColor": "#f7b10f",
      "images": ["https://i.gyazo.com/48348ff0d068a42c414e4350482ef82f.png"],
      "text": {
        "p1": "After many many long years, Community Veteran bhavishya7777, also known as Josh , has finally become an SCP:Roleplay Senior Moderator. Please celebrate with him by pinging with a congrats message, and on behalf of the community, we all love you Josh. Thank you for being the legend you are. Best of luck with your position, and may you forever be remembered here."
      }
    }
  ]
}
